app/controllers/reviews_controller.rb

  def index
    @user_subject = UserSubject.find(params[:user_id])
---
SELECT  "user_subjects".* FROM "user_subjects" WHERE "user_subjects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @user_subject = UserSubject.find(params[:user_subject_id])
---
SELECT  "user_subjects".* FROM "user_subjects" WHERE "user_subjects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]