app/controllers/reviews_controller.rb

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
   @review = Review.find(params[:id])

SELECT  "reviews".* FROM "reviews" INNER JOIN "user_subjects" ON "user_subjects"."id" = "reviews"."user_subject_id" WHERE "user_subjects"."user_id" = $1 AND "reviews"."id" = $2 LIMIT $3  [["user_id", "1"], ["id", 1], ["LIMIT", 1]]
---
  def show_by_user_id
    if params[:id]
      @review = Review.joins(:user_subject).where(:user_subjects => {:user_id => params[:user_id]}).find(params[:id])

SELECT "reviews".* FROM "reviews" INNER JOIN "user_subjects" ON "user_subjects"."id" = "reviews"."user_subject_id" WHERE "user_subjects"."user_id" = $1 AND "user_subjects"."subject_id" = $2  [["user_id", "1"], ["subject_id", "1"]]
---
  def show_by_user_id_and_subject_id
    @reviews = Review.joins(:user_subject).where(:user_subjects => {:user_id => params[:user_id], :subject_id => params[:subject_id]})

INSERT INTO "reviews" ("user_subject_id", "fechaEvaluacion", "nota", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_subject_id", 1], ["fechaEvaluacion", Mon, 10 Oct 2016], ["nota", 100], ["created_at", 2016-10-21 04:48:05 UTC], ["updated_at", 2016-10-21 04:48:05 UTC]]
---
  def create
    @review = Review.new(review_params)

    if @review.save

UPDATE "reviews" SET "user_subject_id" = $1, "title" = $2, "start_date" = $3, "end_date" = $4, "updated_at" = $5 WHERE "reviews"."id" = $6  [["user_subject_id", 2], ["title", "Segunda Evaluacion del ramo"], ["start_date", 2016-10-18 00:00:00 UTC], ["end_date", 2016-10-18 00:00:00 UTC], ["updated_at", 2016-10-24 23:53:18 UTC], ["id", 1]]
---
  def update
    if @review.update(review_params)