app/controllers/subjects_controller.rb

  def index
    @subjects = Subject.all
---
SELECT "user_subjects".* FROM "user_subjects"

  def show_by_user_id
    if params[:subject_id]
      @subjects = Subject.joins(:user_subjects).where(:user_subjects => { :user_id => params[:user_id], :subject_id => params[:subject_id] } )
---
SELECT "subjects".* FROM "subjects" INNER JOIN "user_subjects" ON "user_subjects"."subject_id" = "subjects"."id" WHERE "user_subjects"."user_id" = $1 AND "user_subjects"."subject_id" = $2  [["user_id", 1], ["subject_id", 1]]

  def show_by_user_id_and_semester
    @subjects = Subject.joins(:user_subjects).where(:user_subjects => { :user_id => params[:user_id], :semester => params[:semester] } )
---
SELECT "subjects".* FROM "subjects" INNER JOIN "user_subjects" ON "user_subjects"."subject_id" = "subjects"."id" WHERE "user_subjects"."user_id" = $1 AND "user_subjects"."semester" = $2  [["user_id", 1], ["semester", "2016-2"]]

  def create
    @subject = Subject.new(subject_params)

    if @subject.save
---
INSERT INTO "subjects" ("name", "initials", "credits", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Matematicas IV"], ["initials", "MAT-024"], ["credits", 4], ["created_at", 2016-10-24 03:56:53 UTC], ["updated_at", 2016-10-24 03:56:53 UTC]]

    def set_subject
      @subject = Subject.find(params[:id])
---
SELECT  "user_subjects".* FROM "user_subjects" WHERE "user_subjects"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]