app/controllers/user_subjects_controller.rb

SELECT "user_subjects".* FROM "user_subjects" WHERE "user_subjects"."user_id" = $1  [["user_id", 1]]
---
  def index
    @user_subjects = UserSubject.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "user_subjects" ("user_id", "subject_id", "semester", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["subject_id", 1], ["semester", "2015-2"], ["created_at", 2016-10-20 21:42:48 UTC], ["updated_at", 2016-10-20 21:42:48 UTC]]
---
  def create
    @user = User.find(params[:user_id])
    @user_subject = UserSubject.new(user_subject_params)
    @user_subject.user_id = @user.id

    if @user_subject.save

SELECT  "user_subjects".* FROM "user_subjects" WHERE "user_subjects"."subject_id" = $1 LIMIT $2  [["subject_id", 2], ["LIMIT", 1]]
---
    def set_user_subject
      @user_subject = UserSubject.find(params[:id])