app/controllers/user_subjects_controller.rb

  def destroy_by_subject_id
    @user_subject = UserSubject.find_by_subject_id(params[:subject_id])
    @user_subject.destroy
---
DELETE FROM "user_subjects" WHERE "user_subjects"."id" = $1  [["id", 4]]